Tutorials/reactorCases/3D_KIWI-B-4E/rootCase/0/neutroRegion/defaultFlux2
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2312                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "0/neutroRegion";
    object      defaultFlux2;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 -2 -1 0 0 0 0];

internalField   uniform 1;

boundaryField
{
    "(inlet|outlet|defaultFaces)"
    {
        type            albedoSP3;
        gamma           0.5;
        diffCoeffName   Dalbedo;
        fluxStarAlbedo  fluxStarAlbedo;
        forSecondMoment true;
        value           uniform 1;
    }
}

// ************************************************************************* //
