Tutorials/reactorCases/3D_KIWI-B-4E/rootCase/constant/fluidRegion/phaseProperties
/*--------------------------------*- C++ -*----------------------------------*\
|       ______          _   __           ______                               |
|      / ____/  ___    / | / /          / ____/  ____   ____ _   ____ ___     |
|     / / __   / _ \  /  |/ /  ______  / /_     / __ \ / __ `/  / __ `__ \    |
|    / /_/ /  /  __/ / /|  /  /_____/ / __/    / /_/ // /_/ /  / / / / / /    |
|    \____/   \___/ /_/ |_/          /_/       \____/ \__,_/  /_/ /_/ /_/     |
|    Copyright (C) 2015 - 2022 EPFL                                           |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant/fluidRegion";
    object      phaseProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// ------------------------------------------------------------------------- //
// --- THERMAL-HYDRAULIC TYPE ---------------------------------------------- //
// ------------------------------------------------------------------------- //

thermalHydraulicsType    "onePhase";

// ------------------------------------------------------------------------- //
// --- STRUCTURES PROPERTIES ----------------------------------------------- //
// ------------------------------------------------------------------------- //

structureProperties
{
    fuelElements
    {
        volumeFraction      0.696911; // Calculated with the dimensions found in 1965 LANL
        Dh                  0.00254;

        powerModel
        {
            type                lumpedNuclearStructure;
            volumetricArea      477.305494; // m2/m3
            powerDensity        0; // Will be computed by the neutronic solver
            nodesNumber         1;
            nodeFuel            0;
            nodeClad            1;
            nodeMatrix          0;
            kappaMatrix         50; // 1000; // W/m/K
            heatConductances    (2.451162e+07 1.149520e+07); // W/m3/K
            rhoCp               (3671370); // J/m3/K
            volumeFractions     (1);
            powerFractions      (1);
            T0                  93.3; // K
        }
    }

    unloadedElements
    {
        // V. ZEIGNER, “Survey Description of the Design and Testing of
        // Kiwi-B-4E-301 Propulsion Reactor,” Tech. Rep. LA-3311-MS, Los Alamos
        // Scientific Laboratory (7 1965).
        // "This support rod passed through the cluster plate and the center of
        // the central element, terminating in a button at the core exit end of
        // the rod. The button acted through a perforated molybdenum cone,
        // pyrographite insulation, and a graphite support block to support the
        // fuel elements and central element against the core pressure drop."
        volumeFraction      0.983257; // 0.99;
        Dh                  ${{0.000589/1}}; // ${{0.0095758/100}}; //0.00254;

        passiveProperties
        {
            volumetricArea  113.648950; // 94.707459;
            rho             8190;
            Cp              500;
            T               93.9; // K
        }
    }

    coreSupport
    {
        // Graphite from "1965 LANL - Survey Description of the Design and Testing of Kiwi-BE"
        volumeFraction      0.696911;
        Dh                  0.00254;

        // passiveProperties
        // {
        //     volumetricArea  477.305494; // m2/m3
        //     rho             2260;       // https://material-properties.org/fr/graphite-densite-resistance-durete-point-de-fusion/
        //     Cp              720;        // https://material-properties.org/fr/graphite-densite-resistance-durete-point-de-fusion/
        //     T               83.3; // K
        // }
    }

    // supportPlate
    // {
    //     // Aluminium-6061-T6 from "1965 LANL - Survey Description of the Design and Testing of Kiwi-BE"

    //     volumeFraction      0.696911;
    //     Dh                  0.00254;
    //     localDhAnisotropy   (0 0 1);

    //     passiveProperties
    //     {
    //         volumetricArea  477.305494; // m2/m3
    //         rho             2700;       // https://www.nist.gov/mml/acmd/aluminum-6061-t6-uns-aa96061
    //         Cp              896;        // https://asm.matweb.com/search/specificmaterial.asp?bassnum=ma6061t6 and https://www.nist.gov/mml/acmd/aluminum-6061-t6-uns-aa96061
    //         T               83.3; // K
    //     }
    // }
}

// ------------------------------------------------------------------------- //
// --- REGIME MAP MODEL ---------------------------------------------------- //
// ------------------------------------------------------------------------- //

regimeMapModel
{
    type    none;
}

// ------------------------------------------------------------------------- //
// --- REGIME PHYSICS FOR EACH REGIME -------------------------------------- //
// ------------------------------------------------------------------------- //

physicsModels
{
    dragModels
    {
        fuelElements //:coreSupport:supportPlate"
        {
            // Filonienko equation (Re in [3e3; 5e7])
            // type    Colebrook;
            // coeff   1.82;
            // const   -1.64;
            // exp     -2.0;

            // Determining velocity and friction factor for turbulent flow in smooth
            // tubes, Dawid Taler, International journal of sciences, 105, (2016), 109-122;
            // Re in [3e3; 1e7]
            type    Colebrook;
            coeff   1.2776;
            const   -0.406;
            exp     -2.246;

            // Walton 1992, (2) GRAPH-I-TITE G. Not working
            // type        ReynoldsPower;
            // coeff       ${{0.25 * 363}};
            // const       ${{0.25 * 0.0345}};
            // exp         -1.25;

            // Walton 1992, (5) Basic friction factor and roughness correction. Not working
            // type        ReynoldsPower;
            // coeff       ${{1.35 * 0.046}};
            // exp         -0.2;

            // Walton 1992, (7) Moody friction with 6 = 0.006. A correlation
            // based on the Moody diagram for a roughness of 0.006 was developed
            // (ref. 4) and is shown in the following equation. The relative
            // roughness of 0.006 was measured experimentally from a passage of
            // a fuel element split axially. Not working
            // type        ReynoldsPower;
            // coeff       ${{0.25 * 7.2}};
            // const       ${{0.25 * 0.03172}};
            // exp         -0.75;
        }

        unloadedElements
        {
            type    ReynoldsPower;
            coeff   0.0625;
            exp     -0.32;
        }

        coreSupport
        {
            // Determining velocity and friction factor for turbulent flow in smooth
            // tubes, Dawid Taler, International journal of sciences, 105, (2016), 109-122;
            // Re in [3e3; 1e7]
            type    Colebrook;
            coeff   1.2776;
            const   -0.406;
            exp     -2.246;
        }
    }

    heatTransferModels
    {
        "fuelElements:unloadedElements:coreSupport" //:coreSupport:supportPlate"
        {
            // Simple heat transfer correlations for turbulent tube flow,
            // Dawid Taler and Jan Taler, E3S Web of Conferences 13, 0200
            // (2017), DOI: 10.1051/e3sconf/20171302008
            // 3e3≤ Re ≤1e6, 0.1≤ Pr ≤1
            // type    NusseltReynoldsPrandtlPower;
            // const   0;
            // coeff   0.02155;
            // expRe   0.8018;
            // expPr   0.709;

            // Walton 1992, (I0) Wolf-McCarthy II.
            // This is the earlier of the two correlations developed by these
            // researchers based on experimental data for a hydrogen flow in
            // a electrically heated stainless steel tube (ref.38). The
            // correlation, shown below, was developed over a range of Reynolds
            // numbers from 7800 to 1.55e6 and a range of Tw/Tb from 1.5
            // to 2.8.
            // Nu = 0.023 * Re^0.8 * Pr^0.4 * (Tw/Tb)^(-0.3)
            type    NusseltReynoldsPrandtlPower;
            const   0;
            coeff   0.023; // ${{0.023 * 0.7}};
            expRe   0.8;
            expPr   0.4;
            expTc   -0.3; // -0.2;
        }
    }
}

// ------------------------------------------------------------------------- //
// --- MISCELLANEA --------------------------------------------------------- //
// ------------------------------------------------------------------------- //

pMin        1e4;

pRefCell    0;

pRefValue   1e5;

// ************************************************************************* //
