Tutorials/reactorCases/3D_KIWI-B-4E/rootCase/constant/neutroRegion/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2406                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

3
(
    outlet
    {
        type            patch;
        nFaces          22758;
        startFace       1960692;
    }
    inlet
    {
        type            patch;
        nFaces          22758;
        startFace       1983450;
    }
    defaultFaces
    {
        type            patch;
        nFaces          15750;
        startFace       2006208;
    }
)

// ************************************************************************* //
