Tutorials/reactorCases/3D_KIWI-B-4E/rootCase/constant/regionsDict_steadyStateN
/*--------------------------------*- C++ -*----------------------------------*\
|       ______          _   __           ______                               |
|      / ____/  ___    / | / /          / ____/  ____   ____ _   ____ ___     |
|     / / __   / _ \  /  |/ /  ______  / /_     / __ \ / __ `/  / __ `__ \    |
|    / /_/ /  /  __/ / /|  /  /_____/ / __/    / /_/ // /_/ /  / / / / / /    |
|    \____/   \___/ /_/ |_/          /_/       \____/ \__,_/  /_/ /_/ /_/     |
|    Copyright (C) 2015 - 2022 EPFL                                           |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       dictionary;
    location    "constant";
    object      regionsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Available neutronics solvers
// - diffusionNeutronics
// - SP3Neutronics
// - SNNeutronics
// - pointKinetics
// - adjointDiffusionNeutronics
// Use at least SP3 because small core, diffusion not enough

regionSolvers
{
    Level_0
    {
        neutroRegion    SP3Neutronics;
    }
}

meshDeformation
{
}

mappings
{
    fluidRegion
    {
    }
    neutroRegion
    {
    }
}


// ************************************************************************* //
