Tutorials/reactorCases/3D_KIWI-B-4E/rootCase/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
|       ______          _   __           ______                               |
|      / ____/  ___    / | / /          / ____/  ____   ____ _   ____ ___     |
|     / / __   / _ \  /  |/ /  ______  / /_     / __ \ / __ `/  / __ `__ \    |
|    / /_/ /  /  __/ / /|  /  /_____/ / __/    / /_/ // /_/ /  / / / / / /    |
|    \____/   \___/ /_/ |_/          /_/       \____/ \__,_/  /_/ /_/ /_/     |
|    Copyright (C) 2015 - 2022 EPFL                                           |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application         GeN-Foam;

startFrom           latestTime;

stopAt              endTime;

endTime             1;

deltaT              1;

writeControl        adjustableRunTime;

writeInterval       1;

purgeWrite          2;

writeFormat         ascii;

writePrecision      8;

writeCompression    off;

timeFormat          general;

timePrecision       14;

runTimeModifiable   true;

//- Global options

liquidFuel          false;

//- Time step control options

adjustTimeStep      true;

maxDeltaT           1;

maxCo               10;

maxPowerVariation   0.001;

removeBaffles
{
    fluidRegion     true;
    neutroRegion    false;
}

// #include "functions"


// ************************************************************************* //
