Tutorials/reactorCases/3D_KIWI-B-4E/rootCase/system/fluidRegion/createBafflesDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      createBafflesDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Whether to convert internal faces only (so leave boundary faces intact).
// This is only relevant if your face selection type can pick up boundary
// faces.
internalFacesOnly   true;

// Baffles to create.
baffles
{
    baffle
    {
        //- Use predefined faceZone to select faces and orientation.
        type        faceZone;
        zoneName    baffle;

        patches
        {
            master
            {
                //- Master side patch
                name            baffle_master;
                type            mappedWall; // cyclic; // mappedWall;
                neighbourPatch  baffle_slave;
                sampleMode      nearestPatchFace;
                sampleRegion    fluid;
                samplePatch     baffle_slave;
                offsetMode      uniform;
                transform       coincidentFullMatch;
                offset          (0 0 0);

                patchFields
                {
                    ".*"
                    {
                        type        zeroGradient; // cyclic; // 
                    }

                    U
                    {
                        type        slip;
                        // patchType   cyclic;
                    }
                }
            }

            slave
            {
                //- Slave side patch
                name            baffle_slave;
                type            mappedWall; // cyclic; // mappedWall;
                neighbourPatch  baffle_master;
                sampleMode      nearestPatchFace;
                sampleRegion    fluid;
                samplePatch     baffle_master;
                offsetMode      uniform;
                transform       coincidentFullMatch;
                offset          (0 0 0);

                patchFields
                {
                    ${...master.patchFields}
                }
            }
        }
    }
    
    inletFuelElement
    {
        //- Use predefined faceZone to select faces and orientation.
        type        faceZone;
        zoneName    inletFuelElement;

        patches
        {
            master
            {
                //- Master side patch
                name            inletFuelElement;
                type            cyclic;
                neighbourPatch  inletFuelElement_slave;
                sampleMode      nearestPatchFace;
                sampleRegion    fluid;
                samplePatch     inletFuelElement_slave;
                offsetMode      uniform;
                transform       coincidentFullMatch;
                offset          (0 0 0);

                patchFields
                {
                    "(nut|alphat|epsilon|k|p|p_rgh|T|U)"
                    {
                        type        cyclic;
                    }

                    Tmatrix.lumpedNuclearStructure
                    {
                        type        zeroGradient;
                        patchType   cyclic;
                    }
                }
            }

            slave
            {
                //- Slave side patch
                name            inletFuelElement_slave;
                type            cyclic;
                neighbourPatch  inletFuelElement;
                sampleMode      nearestPatchFace;
                sampleRegion    fluid;
                samplePatch     inletFuelElement;
                offsetMode      uniform;
                transform       coincidentFullMatch;
                offset          (0 0 0);

                patchFields
                {
                    ${...master.patchFields}
                }
            }
        }
    }

    outletFuelElement
    {
        //- Use predefined faceZone to select faces and orientation.
        type        faceZone;
        zoneName    outletFuelElement;

        patches
        {
            master
            {
                //- Master side patch
                name            outletFuelElement;
                type            cyclic;
                neighbourPatch  outletFuelElement_slave;
                sampleMode      nearestPatchFace;
                sampleRegion    fluid;
                samplePatch     outletFuelElement_slave;
                offsetMode      uniform;
                transform       coincidentFullMatch;
                offset          (0 0 0);

                patchFields
                {
                    "(nut|alphat|epsilon|k|p|p_rgh|T|U)"
                    {
                        type        cyclic;
                    }

                    Tmatrix.lumpedNuclearStructure
                    {
                        type        zeroGradient;
                        patchType   cyclic;
                    }
                }
            }

            slave
            {
                //- Slave side patch
                name            outletFuelElement_slave;
                type            cyclic;
                neighbourPatch  outletFuelElement;
                sampleMode      nearestPatchFace;
                sampleRegion    fluid;
                samplePatch     outletFuelElement;
                offsetMode      uniform;
                transform       coincidentFullMatch;
                offset          (0 0 0);

                patchFields
                {
                    ${...master.patchFields}
                }
            }
        }
    }
}

// ************************************************************************* //
