Tutorials/reactorCases/3D_KIWI-B-4E/rootCase/system/sampleNeutroDict
/*--------------------------------*- C++ -*----------------------------------*\
|       ______          _   __           ______                               |
|      / ____/  ___    / | / /          / ____/  ____   ____ _   ____ ___     |
|     / / __   / _ \  /  |/ /  ______  / /_     / __ \ / __ `/  / __ `__ \    |
|    / /_/ /  /  __/ / /|  /  /_____/ / __/    / /_/ // /_/ /  / / / / / /    |
|    \____/   \___/ /_/ |_/          /_/       \____/ \__,_/  /_/ /_/ /_/     |
|    Copyright (C) 2015 - 2022 EPFL                                           |
\*---------------------------------------------------------------------------*/


type                sets;

libs                ( "libsampling.so" );

interpolationScheme cell; // cellPatchConstrained; // pointMVC; // cellPoint; // cellPointFace; // 

setFormat           raw;

sets
(
    NeutroAxial
    {
        type    uniform;
        axis    z;
        start   (0 0.02 -0.66);
        end     (0 0.02 0.66);
        nPoints 1000;
    }

    NeutroAxialR1
    {
        type    uniform;
        axis    z;
        start   (0 0.0438 -0.66);
        end     (0 0.0438 0.66);
        nPoints 1000;
    }

    NeutroAxialR2
    {
        type    uniform;
        axis    z;
        start   (0 0.0938 -0.66);
        end     (0 0.0938 0.66);
        nPoints 1000;
    }
    
    NeutroAxialR3
    {
        type    uniform;
        axis    z;
        start   (0.1447 0 -0.66);
        end     (0.1447 0 0.66);
        nPoints 1000;
    }
    
    NeutroAxialR4
    {
        type    uniform;
        axis    z;
        start   (0.1951 0 -0.66);
        end     (0.1951 0 0.66);
        nPoints 1000;
    }
    
    NeutroAxialR5
    {
        type    uniform;
        axis    z;
        start   (0.2464 0 -0.66);
        end     (0.2464 0 0.66);
        nPoints 1000;
    }
    
    NeutroAxialR6
    {
        type    uniform;
        axis    z;
        start   (0.2973 0 -0.66);
        end     (0.2973 0 0.66);
        nPoints 1000;
    }
    
    NeutroAxialR7
    {
        type    uniform;
        axis    z;
        start   (0.3480 0 -0.66);
        end     (0.3480 0 0.66);
        nPoints 1000;
    }

    NeutroAxialR8
    {
        type    uniform;
        axis    z;
        start   (0 0.3995 -0.66);
        end     (0 0.3995 0.66);
        nPoints 1000;
    }

    NeutroRadial
    {
        type    uniform;
        axis    x;
        start   (0 0 0);
        end     (0.65 0 0);
        nPoints 1000;
    }
);

fields
(
    flux0
    flux1
    oneGroupFlux
    powerDensity
    TFuel
    TCool
    rhoCool
);

//***************************************************************************//